# backend/app/ok_preset_urls.py
# Список из 52 URL групп Одноклассников для автоматического поиска
# Темы: Саранск, Мордовия, птицы, котики, новости, общие интересы


    # --- Саранск и Мордовия (17 групп) ---
PRESET_URLS = [
    # --- Саранск и Мордовия ---
    "https://ok.ru/group/70000001243245",  # Это Саранск!
    "https://ok.ru/group/52683567464630",  # Столица С (Новости Саранска и Мордовии)
    "https://ok.ru/group/53341999399005",
    "https://ok.ru/prodazha.pokupka.prodvizhenie",
    # --- Котики, животные ---
    "https://ok.ru/group/53494939189393",  # Кошки, коты, котики (основная группа)
    "https://ok.ru/group/54109766615246",  # Только животные

    # --- Новости ---
    "https://ok.ru/group/70000043747672",  # Актуальные новости (канал Евгения Солнцева)
    "https://ok.ru/group/58417191780400",  # Новости Минсельхоза

    # --- Птицы, природа ---
    "https://ok.ru/group/70000001114695",  # ПЕРНАТЫЕ ДРУЗЬЯ - ПТИЦЫ ВСЕГДА РЯДОМ
    "https://ok.ru/group/54643613630701",  # Жизнь в царстве природы
]



# Проверка количества (должно быть >=50)
